# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

import room_1
import room_2

# Подскажите, пожалуйста, почему, room подчеркнуто красным.
# TODO Пайтон не может найти этот модуль, ему нужно помочь, уточнив путь
# TODO import lesson_005.room_1 и тд
print('В комнате room_1 живут:', ', '.join(room_1.folks))
print('В комнате room_2 живут:', ', '.join(room_2.folks))










