#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра

def bun():
    print('А теперь добавим булочки!')


def cutlet():
    print('А теперь добавим котлеты!')


def gherkin():
    print('А теперь добавим огурчика!')


def tomato():
    print('А теперь добавим помидорчика!')


def mayonnaise():
    print('А теперь добавим майонеза!')


def cheese():
    print('А теперь добавим сыра!')


def mustard_sauce():
    print('А теперь добавим горчичный соус!')


def onion():
    print('А теперь добавим лук репчатый!')

def Seasoning_grill():
    print('А теперь добавим приправа для гриля!')


def sausages():
    print('А теперь добавим колбаски!')

